### No. 1 Menampilkan data dari HTML ke dataframe agar dapat ditampilkan sesuai dengan yang diinginkan

In [1]:
pip install parse

Collecting parseNote: you may need to restart the kernel to use updated packages.
  Downloading parse-1.19.0.tar.gz (30 kB)
Building wheels for collected packages: parse
  Building wheel for parse (setup.py): started
  Building wheel for parse (setup.py): finished with status 'done'
  Created wheel for parse: filename=parse-1.19.0-py3-none-any.whl size=24581 sha256=bc3609a656fe36119970076837b90561b03c9a219b3ae0a6b78f2c9a5758c091
  Stored in directory: c:\users\lenovo\appdata\local\pip\cache\wheels\e5\33\1f\68392720485b3ecf125a69e700baaab7624616deedea2fa6e2
Successfully built parse
Installing collected packages: parse
Successfully installed parse-1.19.0

In [5]:
import pandas as pd

URL = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
dfs = pd.read_html(URL)
dfs

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [10]:
from bs4 import BeautifulSoup
import pandas as pd
import requests

URL = 'https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
res = requests.get(URL)
dfs = pd.read_html(res.text)
dfs

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [11]:
table = dfs[0]
df = pd.DataFrame(table)
df

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

### No.2 Menampilkan data tabel dari PDF ke dataframe agar dapat ditampilkan sesuai dengan yang diinginkan

In [16]:
pip install tabula-py

Collecting tabula-py
  Downloading tabula_py-2.7.0-py3-none-any.whl (12.0 MB)
Collecting distro
  Downloading distro-1.8.0-py3-none-any.whl (20 kB)
Requirement already satisfied: numpy in c:\users\lenovo\anaconda3\lib\site-packages (from tabula-py) (1.20.1)
Requirement already satisfied: pandas>=0.25.3 in c:\users\lenovo\anaconda3\lib\site-packages (from tabula-py) (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas>=0.25.3->tabula-py) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\lenovo\anaconda3\lib\site-packages (from pandas>=0.25.3->tabula-py) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\lenovo\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas>=0.25.3->tabula-py) (1.15.0)
Installing collected packages: distro, tabula-py
Successfully installed distro-1.8.0 tabula-py-2.7.0
Note: you may need to restart the kernel to use updated packages.

##### Membuka pdf terlebih dahulu kemudian diubah ke dataframe

In [9]:
import tabula
import pandas as pd

df = tabula.read_pdf('Housing_data.pdf', pages='all')
df

[   0.17004  12.5  7.87  0  0.524  6.004  85.9  6.5921  5  311
 0  0.22489  12.5  7.87  0  0.524  6.377  94.3  6.3467  5  311
 1  0.11747  12.5  7.87  0  0.524  6.009  82.9  6.2267  5  311
 2  0.09378  12.5  7.87  0  0.524  5.889  39.0  5.4509  5  311,
    15.2  386.71   17.1  18.9
 0  15.2  392.52  20.45  15.0
 1  15.2  396.90  13.27  18.9
 2  15.2  390.50  15.71  21.7]

In [10]:
from IPython.display import display

# Konversi data tabel ke dalam DataFrame dengan Pandas
df = tables[0]

# Menampilkan DataFrame
display(df)

   0.17004  12.5  7.87  0  0.524  6.004  85.9  6.5921  5  311
0  0.22489  12.5  7.87  0  0.524  6.377  94.3  6.3467  5  311
1  0.11747  12.5  7.87  0  0.524  6.009  82.9  6.2267  5  311
2  0.09378  12.5  7.87  0  0.524  5.889  39.0  5.4509  5  311

##### Secara langsung pdf ke dataframe

In [5]:
import pandas as pd
import tabula
from IPython.display import display

# Membuka file PDF dan menentukan halaman yang berisi tabel
file = "Housing_data.pdf"
page = 'all'

# Mengekstrak data tabel dari halaman PDF menggunakan tabula-py
tables = tabula.read_pdf(file, pages=page)

# Konversi data tabel ke dalam DataFrame dengan Pandas
df = tables[0]

# Menampilkan DataFrame
display(df)

   0.17004  12.5  7.87  0  0.524  6.004  85.9  6.5921  5  311
0  0.22489  12.5  7.87  0  0.524  6.377  94.3  6.3467  5  311
1  0.11747  12.5  7.87  0  0.524  6.009  82.9  6.2267  5  311
2  0.09378  12.5  7.87  0  0.524  5.889  39.0  5.4509  5  311

### No.3 Jelaskan apa yang kamu ketahui tentang Beautiful Soup dan Web Scraping

Web Scraping adalah teknik pengambilan informasi otomatis dari website dan disimpan dalam format tertentu sehingga dapat diolah lebih lanjut oleh komputer. Informasi yang diambil dapat berupa gambar, file, maupun tabel. Dari informasi yang diambil dari website, kita dapat melakukan pembersihan kata-kata yang tidak diperlukan sehingga akan menghasilkan hail scraping yang lebih rapi dan mudah dibaca.

Beautiful Soup merupakan library dari Python yang digunakan untuk melakukan parsing atau penguraian HTML dan XML sehingga data informasi dari HTML dan XML dapat diolah dan diformat. Library beautiful soup dapat digunakan untuk web scraping sehingga informasi dari website dapat diuraikan menjadi kalimat-kalimat. Dengan web scraping dan library beautifulsoup di dalamnya informasi yang diambil tanpa harus copy-paste dengan membuka tutup website.